#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Tue Aug 14 12:44:47 2018

@author: ld-kyle
"""




dict0={'厂商指导价': 'SIP_C_102', '4S店最低报价': 'SIP_C_103', '车厂': 'SIP_C_104', 
       '级别': 'SIP_C_105', '车体结构': 'SIP_C_106', '长x宽x高(mm)': 'SIP_C_293', 
       '发动机': 'SIP_C_107', '变速箱': 'SIP_C_108', '动力类型': 'SIP_C_303',
       '官方最高车速(km/h)': 'SIP_C_112', '工信部油耗(L/100km)': 'SIP_C_294', 
       '官方0-100加速(s)': 'SIP_C_113', '保养周期': 'SIP_C_114', '保养费用': 'SIP_C_304', 
       '保修政策': 'SIP_C_115', '碰撞星级': 'SIP_C_116', '更多实测参数': 'SIP_C_295', 
       '长度(mm)': 'SIP_C_117', '宽度(mm)': 'SIP_C_118', '高度(mm)': 'SIP_C_119', 
       '轴距(mm)': 'SIP_C_120', '前轮距(mm)': 'SIP_C_121', '后轮距(mm)': 'SIP_C_122', 
       '整备质量(kg)': 'SIP_C_123', '车身结构': 'SIP_C_124', '车门数(个)': 'SIP_C_125', 
       '座位数(个)': 'SIP_C_126', '油箱容积(L)': 'SIP_C_127', '行李厢容积(L)': 'SIP_C_128',
       '最小离地间隙(mm)': 'SIP_C_129', '最小转弯半径(m)': 'SIP_C_130',
       '接近角(°)': 'SIP_C_131', '离去角(°)': 'SIP_C_132', '发动机描述': 'SIP_C_134',
       '发动机型号': 'SIP_C_135', '排量(L)': 'SIP_C_136', '汽缸容积(cc)': 'SIP_C_137', 
       '工作方式': 'SIP_C_138', '汽缸数(个)': 'SIP_C_139', '汽缸排列形式': 'SIP_C_140', 
       '每缸气门数(个)': 'SIP_C_141', '气门结构': 'SIP_C_142', '压缩比': 'SIP_C_143', 
       '最大马力(ps)': 'SIP_C_297', '最大功率(kW/rpm)': 'SIP_C_298',
       '最大扭矩(N·m/rpm)': 'SIP_C_299', '升功率(kW/l)': 'SIP_C_148', 
       '混合类型': 'SIP_C_305', '插电形式': 'SIP_C_306', '电动机最大功率(kW)': 'SIP_C_307', 
       '电动机最大扭矩': 'SIP_C_308', '最大行驶里程(km)': 'SIP_C_309', 
       '电池种类': 'SIP_C_310', '电池容量(kWh)': 'SIP_C_311', '燃料': 'SIP_C_149', 
       '供油方式': 'SIP_C_150', '缸盖材料': 'SIP_C_151', '缸体材料': 'SIP_C_152', 
       '排放标准': 'SIP_C_155', '变速箱简称': 'SIP_C_156', '挡位个数': 'SIP_C_157',
       '变速箱类型': 'SIP_C_158', '电机数': 'SIP_C_353', '充电兼容性': 'SIP_C_354', 
       '充电方式': 'SIP_C_355', '快充时间': 'SIP_C_356', '慢充时间': 'SIP_C_357', 
       '驱动方式': 'SIP_C_159', '前悬挂类型': 'SIP_C_160', '后悬挂类型': 'SIP_C_161', 
       '底盘结构': 'SIP_C_162', '前轮胎规格': 'SIP_C_163', '后轮胎规格': 'SIP_C_164', 
       '轮毂材料': 'SIP_C_165', '备胎规格': 'SIP_C_166', '前制动器类型': 'SIP_C_167',
       '后制动器类型': 'SIP_C_168', '驻车制动类型': 'SIP_C_169', '分动器类型': 'SIP_C_170',
       '转向助力': 'SIP_C_171', '可调悬挂': 'SIP_C_172', '空气悬挂': 'SIP_C_173',
       '中央差速器结构': 'SIP_C_322', '中央差速器锁止功能': 'SIP_C_323',
       '前桥限滑差速器/差速锁': 'SIP_C_324', '后桥限滑差速器/差速锁': 'SIP_C_325', 
       '主/副驾驶座安全气囊': 'SIP_C_177_178', '前/后排侧气囊': 'SIP_C_179_180', 
       '前/后头部气帘': 'SIP_C_181_182', '膝部气囊': 'SIP_C_183',
       '安全带未系提示': 'SIP_C_184', '自动防抱死(ABS等)': 'SIP_C_185',
       '制动力分配': 'SIP_C_186', '刹车辅助': 'SIP_C_187', '牵引力控制': 'SIP_C_188', '车身稳定控制': 'SIP_C_189', '主动刹车/安全系统': 'SIP_C_190', '自动驻车': 'SIP_C_191', '上坡辅助': 'SIP_C_358', '陡坡缓降': 'SIP_C_192', '发动机电子防盗': 'SIP_C_193', '车内中控锁': 'SIP_C_194', '遥控钥匙': 'SIP_C_195', '无钥匙启动系统': 'SIP_C_196', '无钥匙进入系统': 'SIP_C_336', '胎压监测装置': 'SIP_C_197', '零胎压继续行驶': 'SIP_C_198', '并线辅助': 'SIP_C_199', '全景摄像头': 'SIP_C_204', '夜视系统': 'SIP_C_205', 'ISO FIX儿童座椅接口': 'SIP_C_312', 'LATCH座椅接口(兼容ISO FIX)': 'SIP_C_313', '儿童安全锁': 'SIP_C_314', '天窗型式': 'SIP_C_316', '运动外观套件': 'SIP_C_210', '电动吸合门': 'SIP_C_212', '电动后备厢': 'SIP_C_337', '感应后备厢': 'SIP_C_338', '车顶行李架': 'SIP_C_339', '车身其它配置': 'SIP_C_300', '真皮方向盘': 'SIP_C_213', '方向盘调节': 'SIP_C_214_215', '方向盘电动调节': 'SIP_C_216', '多功能方向盘': 'SIP_C_217', '方向盘换挡': 'SIP_C_218', '方向盘加热': 'SIP_C_340', '方向盘记忆': 'SIP_C_341', '全液晶仪表盘': 'SIP_C_342', '定速巡航': 'SIP_C_175', '自适应巡航': 'SIP_C_176', '行车电脑显示屏': 'SIP_C_219', 'HUD抬头数字显示': 'SIP_C_200', '前/后倒车雷达': 'SIP_C_343_201', '倒车影像': 'SIP_C_202', '自动停车入位': 'SIP_C_203', '行李舱灯': 'SIP_C_221', '独立电源接口': 'SIP_C_222', '中控液晶屏分屏显示': 'SIP_C_223', '车内其它配置': 'SIP_C_301', '座椅材质': 'SIP_C_224', '运动座椅': 'SIP_C_225', '座椅高低调节': 'SIP_C_226', '腰部支撑调节': 'SIP_C_227', '肩部支撑调节': 'SIP_C_228', '主/副驾驶座电动调节': 'SIP_C_229_230', '后排座椅调节': 'SIP_C_317', '电动座椅记忆': 'SIP_C_233', '前/后座椅加热': 'SIP_C_234_235', '前/后座椅通风': 'SIP_C_236_344', '前/后座椅按摩': 'SIP_C_237_345', '后排座椅放倒方式': 'SIP_C_238_239', '第三排座椅': 'SIP_C_240', '前/后座中央扶手': 'SIP_C_241_242', '后排杯架': 'SIP_C_346', 'CD/DVD': 'SIP_C_321', 'CD支持MP3/WMA': 'SIP_C_247', '外接音源接口': 'SIP_C_248', '扬声器喇叭数量(个)': 'SIP_C_249', '音响品牌': 'SIP_C_250', '蓝牙/车载电话': 'SIP_C_251', '车载电视': 'SIP_C_252', '中控台液晶屏': 'SIP_C_253', '后排液晶屏': 'SIP_C_254', 'GPS导航系统': 'SIP_C_255', '车载信息服务': 'SIP_C_257', '人机交互系统': 'SIP_C_258', '近光灯': 'SIP_C_318', '远光灯': 'SIP_C_347', '日间行车灯': 'SIP_C_260', '前雾灯': 'SIP_C_261', '大灯自动开闭': 'SIP_C_262', '大灯随动调节': 'SIP_C_263', '大灯高度可调': 'SIP_C_264', '大灯清洗装置': 'SIP_C_265', '车内氛围灯': 'SIP_C_266', '自适应远近光': 'SIP_C_348', '转向辅助灯': 'SIP_C_349', '前/后电动车窗': 'SIP_C_267_268', '车窗一键功能': 'SIP_C_269', '车窗防夹手功能': 'SIP_C_270', '防紫外线/隔热玻璃': 'SIP_C_271', '内/外后视镜防眩目': 'SIP_C_319_277', '后视镜电动调节': 'SIP_C_278', '后视镜加热': 'SIP_C_279', '后视镜电动折叠': 'SIP_C_282', '前感应雨刷': 'SIP_C_272', '后雨刷': 'SIP_C_273', '后风挡除霜': 'SIP_C_274', '后风挡遮阳帘': 'SIP_C_275', '后排侧遮阳帘': 'SIP_C_276', '后排侧隐私玻璃': 'SIP_C_350', '后视镜记忆': 'SIP_C_351', '遮阳板化妆镜': 'SIP_C_352', '空调': 'SIP_C_320', '后排出风口': 'SIP_C_285', '前排温度分区控制': 'SIP_C_286', '后排独立温区控制': 'SIP_C_287', '空气调节/花粉过滤': 'SIP_C_288', '车载冰箱': 'SIP_C_289', '风冷手套箱': 'SIP_C_290', '车身可选颜色': 'SIP_C_291', '内饰可选颜色': 'SIP_C_292'}

def get_detail(s):
    return dict0[s]
    